# 1장 데이터 구조에 익숙해지기

# 1-1 데이터 분석과정 이해하기
## 1-1-1 판다스 모듈을 이용한 데이터 분석

### import os 명령을 통하여 os안에 있는 기본명령을 사용할 수가 있다.  
- 기본 os 명령을 사용하려면 <font color='blue'>**import os**</font>명령을 사용한다.  
- *os.* 상태에서 **<탭>키**를 쳐서 부속된 속성(attribute)을 확인할 수가 있다.   
- **작업디렉토리변경(chdir), 작업디렉토리생성(mkdir)** 등 기본적인 작업이 가능하다.

In [475]:
import os 

os.getcwd()   # 내가 현재 어느 폴더에 위치해 있는 지를 표시

'C:\\Users\\User\\PyProjects\\3-2-손에 잡히는 Pandas\\data'

In [476]:
# os.chdir('../HIP-01장 예제')   # 상대경로 이동 
os.chdir('../data')   # 상대경로 이동 

os.getcwd()   # 내가 현재 어느 폴더에 위치해 있는 지를 표시

'C:\\Users\\User\\PyProjects\\3-2-손에 잡히는 Pandas\\data'

### 파이썬 기본 경고메세지 처리(무시 OR 기본값) 하기

In [477]:
import warnings     # 파이썬 기본적인 경고메세지 처리하기

In [478]:
warnings.filterwarnings(action='ignore')      # 기본적인 경고메세지 무시하기 
# warnings.filterwarnings(action='default')    # 기본적인 경고메세지 기본값으로 표시하기

### 이 책에서 사용하는 소프트웨어 버전

In [479]:
import sys
print("Python 버전:", sys.version)

import pandas as pd
print("pandas 버전:", pd.__version__)

import matplotlib
print("matplotlib 버전:", matplotlib.__version__)

import numpy as np
print("NumPy 버전:", np.__version__)

import scipy as sp
print("SciPy 버전:", sp.__version__)

import IPython
print("IPython 버전:", IPython.__version__)

import sklearn
print("scikit-learn 버전:", sklearn.__version__)

Python 버전: 3.8.3 (default, Jul  2 2020, 17:30:36) [MSC v.1916 64 bit (AMD64)]
pandas 버전: 1.0.5
matplotlib 버전: 3.2.2
NumPy 버전: 1.18.5
SciPy 버전: 1.5.0
IPython 버전: 7.16.1
scikit-learn 버전: 0.23.1

## 판다스 모듈은 
- 파이썬에서 사용하는 데이터 분석 라이브러리 
- 금융데이터를 분석하기 위해 만들어 졌다. 
- 행과 열로 구성된 데이터를 분석하기 위해 데이터를 정비하는 도구로 파이썬에서 제공된다.

## 판다스 모듈을 이용한 데이터 분석의 특징 
- 데이터 요약 및 집계 
  - 영업 정보인 매출액, 인프라 기준인 평균 세션타임, 리서치조사인 성문 응답자의 남녀 비중등 다양한 요소의 열(컬럼)이 구성되면 
  - 이 컬럼을 기준으로 그룹화해 집계도 가능하다.  
  - 또한 여러 데이터 프레임을 통합한 후에 하나의 요약된 정보를 추가로 만들 수 있다.

- 데이터 분석 
  - 비즈니스 관점에서 
  - 경영자, 주주 및 여러 이해 관계자들이 가장 눈여겨 볼 수 있는 기본 지표를 
    - 간단하게 수치로 만들거나 과거의 데이터를 비교한 결과도 쉽게 뽑을 수가 있다.  
  - 집계한 결과를 따로 해석하는 과정을 거치지 않아도 간단하게 분석결과를 도출할 수 있다.

- 데이터 시각화 
  - 처리한 데이터를 시각화 처리 
  - 각종 챠트(pie charts, Box Plot, Bar Plot)등의 그래프도 파이썬의 메소드를 지원하므로  
    - 실제 데이터를 요약 및 집계 처리하면서 
    - 그 내용을 시각화한 결과를 바로 볼 수 있게 해준다.

- 데이터 분석에 필요한 구조로 구성 
  - 판다스는 데이터 프레임이라는 클래스로 테이블 구조의 데이터 처리 기능을 지원한다.   
  - 수집된 데이터를 기반하여 
    - 관측된 결과를 행(Row)으로 
    - 특징을 나타내는 것을 열(column)단위로 정리해야 한다.   
    - 이런 데이터를 구성하려면 일단 분석하기 좋은 상태로 사전 정리가 되어 있어야 한다.  (데이터의 전처리)
  - 판다스를 이용하면 데이터를 정리하는 데 효과적이다.

- 데이터 조회의 편리성  
  - 관측된 결과를 행으로, 특징을 열로 구성했는데  
  - 실제 데이터에 쉽게 접근하려면 행과 열에 대한 이름인 레이블을 관리해야 한다.   
  - 판다스의 데이터프레임은 접근 용이성을 위해 별도의 레이블을 제공하고 관리한다.

## 1.1.2 판다스를 이용한 데이터 전처리
- 판다스 모듈의 시리즈와 데이터프레임 클래스는 
  - 데이터 전처리를 하기 위해 변수를 재지정 하거나 
  - 실제 값을 변경하는 다양한 함수와 메소드를 제공한다.  
- 데이터를 재구조할 기능 등을 제공하므로 
  - 열(컬럼)의 정보를 특징으로 변환해서 변수로 변경하는 기준을 제공한다. 
  - 변수들의 개념을 이해하고 
  - 판다스 내부의 함수와 메소드를 샐행하여 열(컬럼)의 정보를 변수화해야 한다.

## 데이터를 정보로 변환하여 변수로 확정짓는 기준
### 변수의 유형 
- 데이터프레임에서 컬럼으로 들어온 정보들을 확인하여 하나의 변수를 지정할 수도 있다. 
- 데이터프레임은 하나의 자료형만을 가지므로 데이터 분석에 필요한 변수를 구성하는 기본 조건을 만족한다.  
- 변수를 분류하는 방법 
  - 수치형 변수 
    - 정수형 : 소숫점이 없는 숫자형  
    - 실수형 : 소숫점이 있는 숫자형  
  - 텍스트(스트링)형 
    - 문자형(스트링) 
    - 범주형

### 파이썬의 자료형(DataType)

- 정수형(integer) : -1, 0, 1, 2, 3  -> 소숫점이 없다.     
  - 파이썬의 정수형은 표현값에 한계가 거의 없다.  
- 실수형(float)   : 0.01, 3.14, 9.8   -> 반드시 소숫점으로 표현이 된다.  
- 문자열형(string) : 'abcdef' , 'hello world'   
  - 문자열은 
    - '데이터'(단일인용부호)
    - "데이터"(이중인용부호)
    - """데이터"""(삼중인용부호) 모두 사용
- type() 함수 : 변수의 자료형을 알고 싶을 때에 사용

- 숫자 표현 예제 
  - 정수 : 123, -345, 0    # 소숫점이 없는 숫자  
  - 실수 : 123.45, -1234.5 # 소숫점으로 표현되는 숫자 
  - 8진수 : 0o34 , 0o25    # 8진수는 반드시 0o로 시작되어야 한다.  
  - 16진수: 0x2A , 0xFF    # 16진수는 반드시 0x로 시작된다.

### 범주(Array)형 변수 처리 
- 판다스는 범주형 데이터 자료형을 제공한다.  
- 텍스트 값이 규칙적으로 작은 범주를 이루면 범주형 변수를 만들어서 관리한다.

### 변수 선정  
- 간명성(parsimory) 또는 간결성(compactness)을 유지할 수 있는 다양한 메소드를 제공하여
- 컬럼을 통합하여 하나의 변수로 만든다.

### 누락값(결측치) 보정 및 변경 
- 누락 값(Null) : 실제 값이 들어오지 않는 것 (기타조건) 
- Null값을 삭제하거나 변경할 수 있는 기능을 제공하여 처리할 수가 있다.  
- Null값을 삭제하는 것이 데이터 분석에 중요하지 않을 경우 
  - 일부는 Null값을 다른 값으로 수정하여 보정하거나 
  - 특정 값으로 변경하여야 관측값을 버리지 않고 데이터 분석에 사용가능하다.

### 데이터 접근 레이블의 지정 
- Row와 컬럼의 정보를 정리하고 나서 실제 변수와 관측 결과에 대한 명확한 이름도 중요하다. 
- 데이터 분석자와 데이터 사용자 간에 정보의 기준을 간은 개념으로 정의해야 한다.  
- Row(열)와 컬럼(행)의 레이블을 지정하여 
  - 반드시 개념을 확립해야 하며 
  - 실제 행(Row)과 열(컬럼)의 정보에 접근하여 조회할 때의 기준을 명확한 기준을 정의할 수가 있다.

## 1.1.3 판다스를 이용한 데이터 시각화 
- 판다스는 데이터의 처리 결과 및 특성을 그래프로 볼 수 있는 시각화 기능도 제공한다.  
- 시각화에서는 
  - 단순하게 데이터들의 미적형태를 확인할 수가 있으며 
  - 데이터의 추세 및 빈도 등을 볼 수 있는 기능도 제공한다.   
  - 이를 이용해서 데이터의 특성을 포함한다.

### 시각화 절차와 단계기준 
- 정보 조직화 단계 
- 정보 시각화 단계 
- 상호작용 단계

# 1-2  연산자와 메소드
- 모든 예제는 주피터 노트북으로 작성되었다.  
- 대화식(interactive) 방식 : 코드를 넣고 실행하면 바로 결과를 볼 수가 있다.

In [480]:
import pandas as pd     # pandas 모듈 불러오기 
                        # 일반적으로 이렇게 처리한다.

In [481]:
pd.__version__      # pandas version 확인

'1.0.5'

### 시리즈 
- 1차원 벡터이므로 파이썬의 리스트를 넣으면 생성된다.  
- 시리즈에는 단일 자료형만 들어간다.  
  - 명시적인 레이블을 붙여서 인덱스로 사용될 수도 있고 
  - 파이썬 리스트 안의 인덱스처럼 안묵적인 숫자 타입의 인덱스도 실행이 된다.

In [870]:
ser = pd.Series([1,2,3])     # [1,2,3]을 기초로 pandas Series로 생성  
ser                          # 연산 결과는 반드시 시리즈 객체로 반환된다.

0    1
1    2
2    3
dtype: int64

In [748]:
ser + ser          # 배열을 활용한 덧셈 수행 
                   # 파이썬에서는 반드시 Index가 0부터 시작함

0    2
1    4
2    6
dtype: int64

In [749]:
ser.add(ser)       # .add 메소드를 제공하는 이유는 
                   # 다양한 처리가 필요할 때 매개변수를 넣어서 처리가 가능하기 때문이다.

0    2
1    4
2    6
dtype: int64

In [750]:
ser                # 각종 연산을 수행하여도 원본값은 변하지 않음 (원형이라고도 함)

0    1
1    2
2    3
dtype: int64

# 1-2  검색과 슬라이싱 편리성

- Sequence 자료형 
  - 숫자나 키값()주로 문자열)을 가지고 검색을 한다.  
  - 특정부분을 검색하여 조회시 슬라이싱을 사용한다.  
- 판다스는 행과 열에 별도의 이름인 레이블을 추가할 수 있으며 
  - 이를 이용해 검색(indexing)과 슬라이싱을 할 수가 있다.  
- 행과 열에 대한 다양한 접근 방식 뿐만 아니라 
  - 내부의 원소 및 부분집합을 만들 수 있는 구조도 제공한다.

In [878]:
df = pd.DataFrame(ser)   # 2차원 배열을 데이터프레임으로 구성하여 선언할 수가 있다.  
df                       # 인덱스 + 데이터값으로 구성된다.

   0
0  1
1  2
2  3

In [879]:
df[0]                # 컬럼 Heading이 0인 자료를 조회 
                     # 데이터프레임은 2차원 배열이므로 인덱스를 넣어 조회하면 Series가 조회된다.

0    1
1    2
2    3
Name: 0, dtype: int64

In [880]:
df.iloc[0]           # 0행에 있는 자료 조회 
                     # 행을 기준으로 조회시 인덱서를 제공하고 행의 안묵적 인덱스를 기준으로 읽는다.

0    1
Name: 0, dtype: int64

In [881]:
df.iloc[0,0]         # [0,0]에 해당하는 자료를 조회 
                     # 데이터프레임의 행의 레이블은 순서와 상관없이 생성해도 되므로 
                     # 실제 레이블을 검색하는 .loc 속성과 
                     # 안묵적 인덱스를 검색하는 .iloc 속성을 제공한다.

1

In [882]:
df[0]

0    1
1    2
2    3
Name: 0, dtype: int64

- 인덱싱 연산자를 연속적으로 호출해도 
  - 가장 하위의 원소를 검색할 수 있지만 
  - 행과 열을 한꺼번에 표시해서 처리하는 것이 더 편하다.

In [897]:
df[0][0]

1

# 1-3  인스턴스를 관리하는 속성

### 행과 열에 대한 인덱스 정보 관리 
- 인덱스는 내부 정보를 관리하면서 정보를 연결해 
  - 특정 원소값과 부분 집합을 처리할 수 있는 구조를 구성한다.  
  - 데이터 처리는 넘파이 클래스로 처리하므로 넘파이 모듈과의 연계성을 그대로 유지한다.

In [898]:
df2 = pd.DataFrame(data=[[0,1,2],[3,4,5]], index=list('ab'),
                  columns=list('cde'))  
df2        # sample DataFrame 구성

   c  d  e
a  0  1  2
b  3  4  5

In [899]:
type(df2.index)      # 레이블을 관리하는 기본 속성은 인덱스 클래스

pandas.core.indexes.base.Index

In [893]:
type(df2.columns)

pandas.core.indexes.base.Index

In [894]:
type(df2.values)    # 데이터를 관리하는 기본 속성은 ndarray 
                   # numpy에서 기본 제공되는 1차원 배열 : ndarray

numpy.ndarray

In [895]:
type(df2.iloc)      # 행을 관리하는 인덱서의 정의

pandas.core.indexing._iLocIndexer

In [896]:
type(df2.loc)       # 컬럼을 관리하는 인덱서의 정의

pandas.core.indexing._LocIndexer

# 1-4 변수에 할당

In [901]:
df3 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  columns=list('abc'))
df3

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [903]:
df_a = df3      # df_a를 별도로 정의하여 본래 선언된 df의 변경이 없도록 조치한다. 
               # 파이썬에서는 일반적으로 이렇게 복사하여 처리한다.  
df_a

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [904]:
df_a['a'] = 100     # a컬럼에 데이터를 전부 100으로 
               # 위와 같이 별도의 데이터프레임으로 받아서 처리하므로 
               # 특정 컬럼에 대해 일괄로 변경이 가능하다.

In [905]:
df_a

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [911]:
df3             # 처음 선언된 것이 함께 변화된 것을 알 수가 있다.   
               # 주소를 공유하는 방식 (call by reference)

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [907]:
id(df3),id(df_a)      # df와 df_a의 저장된 주소를 조회해 본 결과 같은 곳을 참고하고 있슴

(1955092878432, 1955092878432)

In [908]:
df3.values.base is df_a.values.base

True

- 위에서 선택 연산자를 사용한 경우 
  - 기존 객체의 값을 바꿨지만 
  - 다른 연산자나 메소드등은 기존 원본은 변경하지 않고 
    - 새로운 사본을 만들어 관리한다.

## 예제 1-5  연산을 수행할 경우 새로운 인스턴스 생성

In [912]:
df4 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  columns=list('abc'))
df4

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [913]:
df_b = df4 + 99  # 데이터프레임에 특정 값을 더하여 새로운 데이터프레임을 생성하였다.

In [914]:
df_b

     a    b    c
0  100  101  102
1  103  104  105
2  106  107  108

In [916]:
id(df_b), id(df4)   # 데이터 프레임을 별도로 복사하여 실행하였슴을 알 수가 있다.

(1955086233216, 1955101298752)

In [917]:
df_b.values.base is df4.values.base    # 별도의 결과를 만들어서 제공한다.

False

In [918]:
df4    # 연산 결과와 상관없이 기존 데이터 값을 그대로 유지되는 것을 알 수가 있다.

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

- 시리즈를 만들어서 데이터프레임과 똑같이 처리되는 지를 확인해보자. 
  - S2 변수에 시리즈가 할당된 s1을 할당한 후에 두 개의 레퍼런스를 확인하면 
  - 두 개의 변수에 저장된 레퍼런스가 같은 것을 알 수가 있다.

In [919]:
import numpy as np

In [777]:
s1 = pd.Series(index=list('abcd'), data=np.arange(4))   # 1차원 배열(ndarray)를 기초로 판다스 Series를 생성

In [778]:
s2 = s1

In [779]:
s1 is s2

True

In [780]:
id(s1), id(s2)        # 같은 메모리 장소를 사용하였슴을 알 수가 있다.

(1955042350848, 1955042350848)

In [781]:
s3 = s1.copy()        # 시리즈를 복사하여 새로운 시리즈를 다른 장소에 복제한다.

In [782]:
s1 is s3

False

In [783]:
id(s1), id(s3)        # 다른 메모리 장소를 사용하였슴을 알 수가 있다.

(1955042350848, 1955087306960)

## 예제 1- 6 __getitem__ 이해하기

In [784]:
pd.Series.__getitem__

In [785]:
pd.DataFrame.__getitem__

In [786]:
pd.Index.__getitem__

In [787]:
pd.MultiIndex.__getitem__

In [788]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]],index=['a','b'],
                  columns=['가','나','다','라'])

In [789]:
df.loc.__getitem__

In [790]:
df.iloc.__getitem__

In [791]:
df

   가  나  다  라
a  1  2  3  4
b  5  6  7  8

In [792]:
df['나']

a    2
b    6
Name: 나, dtype: int64

In [793]:
df.__getitem__('나')

a    2
b    6
Name: 나, dtype: int64

In [794]:
ser = df['나']

In [795]:
ser

a    2
b    6
Name: 나, dtype: int64

In [796]:
ser['a']

2

In [797]:
ser.__getitem__('a')

2

In [798]:
ser.__getitem__(ser > 3)

b    6
Name: 나, dtype: int64

In [799]:
df.__getitem__(df > 3)

     가    나    다  라
a  NaN  NaN  NaN  4
b  5.0  6.0  7.0  8

## 예제 1-7  브로드캐스팅과 벡터화 연산

In [800]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  columns=list('abc'))

In [801]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [802]:
df + 3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [803]:
df1 = pd.DataFrame([[3,3,3],[3,3,3],[3,3,3]],
                  columns=list('abc'))

In [804]:
df1

   a  b  c
0  3  3  3
1  3  3  3
2  3  3  3

In [805]:
df + 3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [806]:
df + df1

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [807]:
type(df.__add__)

method

In [808]:
type(df.__add__.__func__)

function

In [809]:
type(df.add)

method

In [810]:
type(df.add.__func__)

function

In [811]:
df.__add__.__func__ is df.add.__func__

False

## 예제 1-8 결측값으로 인스턴스 생성

In [812]:
import numpy as np

In [813]:
df_na = pd.DataFrame([1,2,np.nan])

In [814]:
df_na

     0
0  1.0
1  2.0
2  NaN

In [815]:
df_na.sum()

0    3.0
dtype: float64

In [816]:
df_na.sum(skipna=False)

0   NaN
dtype: float64

In [817]:
df_na < 3

       0
0   True
1   True
2  False

In [818]:
df_na < np.nan

       0
0  False
1  False
2  False

## 예제 1-9 축 알아보기

In [819]:
df_sax = pd.Series([1,2,3,4])

In [820]:
df_sax

0    1
1    2
2    3
3    4
dtype: int64

In [821]:
df_sax.sum(axis=0)

10

In [822]:
df_dax = pd.DataFrame([[1,2,3,4],[5,6,7,8]])

In [823]:
df_dax

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [824]:
df_dax.sum(axis=0)

0     6
1     8
2    10
3    12
dtype: int64

In [825]:
df_dax.sum(axis=1)

0    10
1    26
dtype: int64

## 예제 1-10 내부 원소 처리 기준

In [826]:
import numpy as np

In [827]:
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'))

In [828]:
df_1

   A  B  C
0  2  9  5
1  7  6  3
2  9  6  2

In [829]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('CAB'))

In [830]:
df_2

   C  A  B
0  3  2  8
1  8  7  7
2  5  6  4

In [831]:
np.log(df_2)

          C         A         B
0  1.098612  0.693147  2.079442
1  2.079442  1.945910  1.945910
2  1.609438  1.791759  1.386294

In [832]:
df_1 + df_2

    A   B   C
0   4  17   8
1  14  13  11
2  15  10   7

In [833]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)),columns=list('CB'))

In [834]:
df_3

   C  B
0  1  1
1  7  3
2  3  7

In [835]:
df_1 + df_3

    A   B   C
0 NaN  10   6
1 NaN   9  10
2 NaN  13   5

## 예제 1-11 한글 인코딩 알아보기 
- 교재 Page 31

### 파이썬 Markdown에 대하여  
- 마크다운의 간단한 사용법 : https://blog.naver.com/kwonkise/222096598241 
- 마크다움에 대한 간단한 동영상 
  - https://www.youtube.com/watch?v=ziiUSCaxKHY

### 파일 Encoding 알아보기 
  - 파일을 읽고 그 파일이 어떤 형태로 한글 인코딩 되는 지를 알아볼 필요가 있다.  
  - 이때 chardet 모듈을 설치하여 사용할 수가 있다.  
- <font color="blue">**주피터 노트북에서 실제 쉘 명령을 실행**</font>하려면 
  - **느낌표(!)를 처음에 붙이고** 
  - *쉘 명령어인 pip로 파이썬 모듈인 chardet을 실행*시킨다.     
  
- 설치된 패키지를 확인할 경우에는 아래와 같이 실행한다.  
  - pip search chardet <이렇게 하면 됨>  
  - conda list chardet <여러분들은 이렇게 사용하는 것이 더 좋음>

In [836]:
!pip install chardet

Requirement already satisfied: chardet in c:\cosmos\anaconda3\lib\site-packages (3.0.4)

#### 자료분석시 CSV를 주로 사용하는 이유 
- CSV로 생성된 파일의 크기가 매우 작다.  엑셀에 비해서 약 1/10 정도의 크기 
- 알맹이가 txt형태이므로 일반 editor에서도 함께 작업이 가능함 
- 대용량 데이터의 경우 한 창(sheet)에 배열 형태로 저장이 가능 
  - 엑셀의 경우는 .xls(excel-2007이하)의 경우에는 65,536건만 시트에 저장됨 
    - 6만건을 초과하는 자료의 경우 시트 2개에 나누어 담아야 하는데 .csv는 상관없슴  
    - .xlsx(excel-2007이후)의 경우 2014이하는 약 20만건, 2017의 경우 약 70만건의 데이터를 담을 수가 있슴
  - CSV의 경우는 약 1억건 정도도 한 파일에 저장이 가능하고 전달이 가능하다.     
    - 파일의 실제 Size가 약 1GB가 넘게되어서 윈도우에서 작업을 할 경우에 매우 오래 걸리게 된다.  
    - 서버(리눅스 자료분석서버)에 Linux를 깔고 HDFS(Hadoop Distributed File System)에 저장시키고 
    - 여러 대의 서버에서 블록별로 나누어서(1block = 64MB Or 256MB) 작업을 하게 된다.

- 이렇게 서로 다른 OS(운영체제)간에 자료를 주고받아서 처리하는 경우 
  - 각 OS가 선호하는 한글방식이 각각 다르므로 (Window는 ANSI, Linux는 UTF-8을 선호) 
  - 자료를 주고받을 경우 한글방식을 미리 확인하고 맞추어서 작업을 하게 된다.

In [1]:
import chardet
import pandas as pd

In [2]:
# 작업 디렉토리 확인  
import os  

os.getcwd()    # cwd:현재작업폴더 위치 
               # 윈도우의 경우 경로표시가 \(원표시)가 되는데 파이썬에서는 이것을 \\로 인식한다.  
               # 리눅스와 윈도우가 모두 인식할 수 있도록 경로를 지정시 /를 사용하면 양쪽에 작업이 
               # 용이하게 된다.

'C:\\Users\\User\\PyProjects\\3-2-손에 잡히는 Pandas\\HIP-01장 예제'

In [4]:
def find_encoding(fname):
    r_file = open(fname, 'rb').read()
    result = chardet.detect(r_file)
    charenc = result['encoding']
    return charenc

In [8]:
my_encoding1 = find_encoding('../data/weight_loss.csv')   # 파일을 읽었는데 전통적인 엑셀포맷으로 저장됨 
my_encoding1                                              # EUC-KR : 2Byte 완성형 한글
                                                          # cp949 : 2byte조합형 한글   
                                                          # utf-8 : 3byte조합형 한글 
                                                          # cp949와 utf-8은 windows에서는 그냥 호환이 됨

'EUC-KR'

In [9]:
df_1 = pd.read_csv('../data/weight_loss.csv', encoding=my_encoding1)
df_1.head()

   이름   월   주  몸무게
0  지완  1월  1주   70
1  찬준  1월  1주   60
2  지완  1월  2주   69
3  찬준  1월  2주   59
4  지완  1월  3주   69

In [12]:
# 그런데 euc-kr 파일을 utf-8로 읽으면 어떻게? 

try :
    pd.read_csv('../data/weight_loss.csv', encoding="utf-8")
    
except Exception as e :
    print(e)

'utf-8' codec can't decode byte 0xc0 in position 0: invalid start byte

- 위에 처럼 
  - 같은 파일을 가지고 인코딩할 때 
  - utf-8을 매개변수로 전달하면 
  - euc-kr로 인코딩 된 것을 처리할 수가 없어서 예외가 발생하게 된다.

In [13]:
my_encoding2 = find_encoding('../data/korea_movie_list.csv')
df_2 = pd.read_csv('../data/korea_movie_list.csv', encoding=my_encoding2)

In [14]:
my_encoding2

'CP949'

- 아래처럼 CP949형태의 인코딩된 파일을 utf-8로 인코딩된 형태로 읽게되면 
  - 주로 특수문자를 관리하는 기준이 달라서 
  - 변환될 수 없는 것이 예외로 발생하기도 한다.

In [15]:
try :
    pd.read_csv('../data/korea_movie_list.csv', encoding="utf-8")
    
except Exception as e :
    print(e)

'utf-8' codec can't decode byte 0xc7 in position 139: invalid continuation byte

In [16]:
df_2.head()

,movie_code,title,title_Eng,show_time,produce_year,open_date,produce_state,type,nation,genre,director,actor,show_type,watch_grade
0,20185801,할로우 차일드,The Hollow Child,88.0,2017,20180802,개봉예정,장편,캐나다,공포(호러)/판타지,제레미 루터,NaN,NaN,15세이상관람가
1,20187649,죽음의 리무진,Glass Coffin,75.0,2016,20180816,개봉예정,장편,스페인,스릴러/공포(호러),하리츠 쥬빌라가,파울라 본템피,NaN,NaN
2,20187641,극장판 도라에몽: 진구의 보물섬,NaN,107.0,2018,20180815,개봉예정,장편,일본,애니메이션/SF/어드벤처,이마이 카즈아키,윤아영/김정아/조현정/최낙윤/이현주/임은정/김정은/이지현/이경태/강은애/박성영/이다...,"2D,디지털더빙",전체관람가
3,20187427,명탐정 코난 : 제로의 집행인,Detective Conan: Zero the Enforcer,110.0,2018,20180808,개봉예정,장편,일본,애니메이션,타치카와 유즈루,타카야마 미나미/야마자키 와카나/코야마 리키야/푸루야 토루,"2D,디지털/2D,디지털더빙",12세이상관람가
4,20173732,살아남은 아이,Last Child,123.0,2017,20180830,개봉예정,장편,한국,드라마,신동석,최무성/김여진/성유빈,"2D,디지털",NaN

#### 꼭 알아둘 것  
- 엑셀을 가지고 csv 파일을 만들어서 별도의 변환을 하지 않으면 
  - 엑셀은 기본적으로 cp949를 사용한다.  
  - 따라서 파이썬에서 이 파일을 읽고 처리하려면 반드시 cp949로 인토딩해야 한다.  
  - 한글도 utf-8로 저장되는 editor를 사용할 때는 
    - utf-8로 한글을 처리하므로 
    - csv파일을 인코딩하려면 utf-8로 처리해야 한다.

In [17]:
my_encoding3 = find_encoding('../data/korea_movie_list.csv')
df_3 = pd.read_csv('../data/korea_movie_list.csv', engine='python')

In [18]:
my_encoding3

'CP949'

In [19]:
df_3.head(2)

,movie_code,title,title_Eng,show_time,produce_year,open_date,produce_state,type,nation,genre,director,actor,show_type,watch_grade
0,20185801,할로우 차일드,The Hollow Child,88.0,2017,20180802,개봉예정,장편,캐나다,공포(호러)/판타지,제레미 루터,NaN,NaN,15세이상관람가
1,20187649,죽음의 리무진,Glass Coffin,75.0,2016,20180816,개봉예정,장편,스페인,스릴러/공포(호러),하리츠 쥬빌라가,파울라 본템피,NaN,NaN

#### 참고할 내용 
- 참고할 문서 : https://blog.naver.com/huangha/221872040335   
- CSV로 저장된 문서를 읽어올 때에 사용된다.

In [20]:
try :
    pd.read_csv('../data/korea_movie_list.csv', engine='c')
except Exception as e :
    print(e)

'utf-8' codec can't decode byte 0xc7 in position 0: invalid continuation byte

#### 이번에는 웹에 있는 문서를 불러와 보자

In [22]:
url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/attention.csv'
url

'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/attention.csv'

In [23]:
df_att = pd.read_csv(url,error_bad_lines=False)
# df_att

In [24]:
df_att.head()

   Unnamed: 0  subject attention  solutions  score
0           0        1   divided          1    2.0
1           1        2   divided          1    3.0
2           2        3   divided          1    3.0
3           3        4   divided          1    5.0
4           4        5   divided          1    4.0

In [25]:
df_att.drop('Unnamed: 0',axis=1).head()    # 특정 컬럼을 삭제시킬 때에 이렇게 사용한다.

   subject attention  solutions  score
0        1   divided          1    2.0
1        2   divided          1    3.0
2        3   divided          1    3.0
3        4   divided          1    5.0
4        5   divided          1    4.0

#### 읽어온 파일을 저장하는 방법

In [855]:
df1 = pd.DataFrame({'Names': ['Andreas', 'George', 'Steve',
                           'Sarah', 'Joanna', 'Hanna'],
                   'Age':[21, 22, 20, 19, 18, 23]})
df2 = pd.DataFrame({'Names': ['Pete', 'Jordan', 'Gustaf',
                           'Sophie', 'Sally', 'Simone'],
                   'Age':[22, 21, 19, 19, 29, 21]})
df3 = pd.DataFrame({'Names': ['Ulrich', 'Donald', 'Jon',
                           'Jessica', 'Elisabeth', 'Diana'],
                   'Age':[21, 21, 20, 19, 19, 22]})
df1

     Names  Age
0  Andreas   21
1   George   22
2    Steve   20
3    Sarah   19
4   Joanna   18
5    Hanna   23

In [856]:
df2

    Names  Age
0    Pete   22
1  Jordan   21
2  Gustaf   19
3  Sophie   19
4   Sally   29
5  Simone   21

In [857]:
df3

       Names  Age
0     Ulrich   21
1     Donald   21
2        Jon   20
3    Jessica   19
4  Elisabeth   19
5      Diana   22

In [858]:
df = pd.concat([df1, df2, df3], keys =['Group1', 'Group2', 'Group3'],
               names=['Group', 'Row Num']).reset_index()  
# df

In [859]:
df.to_csv('../data/MultipleDfs.csv', index=False)

In [860]:
my_encoding4 = find_encoding('../data/MultipleDfs.csv')
df_3 = pd.read_csv('../data/MultipleDfs.csv', engine='python')
df_3.head(10)

    Group  Row Num    Names  Age
0  Group1        0  Andreas   21
1  Group1        1   George   22
2  Group1        2    Steve   20
3  Group1        3    Sarah   19
4  Group1        4   Joanna   18
5  Group1        5    Hanna   23
6  Group2        0     Pete   22
7  Group2        1   Jordan   21
8  Group2        2   Gustaf   19
9  Group2        3   Sophie   19

In [861]:
my_encoding4

'ascii'

#### To_CSV  
- Manual 내용  
pandas.DataFrame.to_csv
DataFrame.to_csv(self, path_or_buf: Union[str, pathlib.Path, IO[~ AnyStr], NoneType] = None, sep: str = ',', na_rep: str = '', float_format: Union[str, NoneType] = None, columns: Union[Sequence[Union[Hashable, NoneType]], NoneType] = None, header: Union[bool, List[str]] = True, index: bool = True, index_label: Union[bool, str, Sequence[Union[Hashable, NoneType]], NoneType] = None, mode: str = 'w', encoding: Union[str, NoneType] = None, compression: Union[str, Mapping[str, str], NoneType] = 'infer', quoting: Union[int, NoneType] = None, quotechar: str = '"', line_terminator: Union[str, NoneType] = None, chunksize: Union[int, NoneType] = None, date_format: Union[str, NoneType] = None, doublequote: bool = True, escapechar: Union[str, NoneType] = None, decimal: Union[str, NoneType] = '.') → Union[str, NoneType][source]
Write object to a comma-separated values (csv) file.

Changed in version 0.24.0: The order of arguments for Series was changed.

Parameters
path_or_bufstr or file handle, default None
File path or object, if None is provided the result is returned as a string. If a file object is passed it should be opened with newline=’’, disabling universal newlines.

Changed in version 0.24.0: Was previously named “path” for Series.

sepstr, default ‘,’
String of length 1. Field delimiter for the output file.

na_repstr, default ‘’
Missing data representation.

float_formatstr, default None
Format string for floating point numbers.

columnssequence, optional
Columns to write.

headerbool or list of str, default True
Write out the column names. If a list of strings is given it is assumed to be aliases for the column names.

Changed in version 0.24.0: Previously defaulted to False for Series.

indexbool, default True
Write row names (index).

index_labelstr or sequence, or False, default None
Column label for index column(s) if desired. If None is given, and header and index are True, then the index names are used. A sequence should be given if the object uses MultiIndex. If False do not print fields for index names. Use index_label=False for easier importing in R.

modestr
Python write mode, default ‘w’.

encodingstr, optional
A string representing the encoding to use in the output file, defaults to ‘utf-8’.

compressionstr or dict, default ‘infer’
If str, represents compression mode. If dict, value at ‘method’ is the compression mode. Compression mode may be any of the following possible values: {‘infer’, ‘gzip’, ‘bz2’, ‘zip’, ‘xz’, None}. If compression mode is ‘infer’ and path_or_buf is path-like, then detect compression mode from the following extensions: ‘.gz’, ‘.bz2’, ‘.zip’ or ‘.xz’. (otherwise no compression). If dict given and mode is ‘zip’ or inferred as ‘zip’, other entries passed as additional compression options.

Changed in version 1.0.0: May now be a dict with key ‘method’ as compression mode and other entries as additional compression options if compression mode is ‘zip’.

quotingoptional constant from csv module
Defaults to csv.QUOTE_MINIMAL. If you have set a float_format then floats are converted to strings and thus csv.QUOTE_NONNUMERIC will treat them as non-numeric.

quotecharstr, default ‘”’
String of length 1. Character used to quote fields.

line_terminatorstr, optional
The newline character or character sequence to use in the output file. Defaults to os.linesep, which depends on the OS in which this method is called (‘n’ for linux, ‘rn’ for Windows, i.e.).

Changed in version 0.24.0.

chunksizeint or None
Rows to write at a time.

date_formatstr, default None
Format string for datetime objects.

doublequotebool, default True
Control quoting of quotechar inside a field.

escapecharstr, default None
String of length 1. Character used to escape sep and quotechar when appropriate.

decimalstr, default ‘.’
Character recognized as decimal separator. E.g. use ‘,’ for European data.

Returns
None or str
If path_or_buf is None, returns the resulting csv format as a string. Otherwise returns None.

#### To_CSV 관련 참고자료 
- 웹주소 : https://daeunginfo.blogspot.com/2019/04/pandas-excelcsv.html

#### 위에 작업했었던 df_att를 csv로 저장을 한다면

In [862]:
df_att.head()

   Unnamed: 0  subject attention  solutions  score
0           0        1   divided          1    2.0
1           1        2   divided          1    3.0
2           2        3   divided          1    3.0
3           3        4   divided          1    5.0
4           4        5   divided          1    4.0

In [936]:
df_att.to_csv('../data/Web_Crawling_평점매기기.csv', index=False)   # CSV형식으로 저장

In [937]:
my_encoding4 = find_encoding('../data/Web_Crawling_평점매기기.csv')
df_att2 = pd.read_csv('../data/Web_Crawling_평점매기기.csv', engine='python',encoding=my_encoding4)
df_att2.head(7)

   Unnamed: 0  subject attention  solutions  score
0           0        1   divided          1    2.0
1           1        2   divided          1    3.0
2           2        3   divided          1    3.0
3           3        4   divided          1    5.0
4           4        5   divided          1    4.0
5           5        6   divided          1    5.0
6           6        7   divided          1    5.0

#### to_csv 명령에 대하여 
- CSV처리하기 참고문서 : https://infinitt.tistory.com/31  
- 파이썬 베이직-CSV처리하기 : https://woolbro.tistory.com/35  
- 문용준 엑셀,CSV처리하기 : PDF를 참고할 것

In [938]:
# to_csv append 모드 사용하기 

import pandas as pd
import os

# 샘플 데이터 생성
soda = {'상품명': ['콜라', '사이다'], '가격': [2700, 2000]}
df_test = pd.DataFrame(soda)
df_test

   상품명    가격
0   콜라  2700
1  사이다  2000

In [939]:
# .to_csv 
# 최초 생성 이후 mode는 append

if not os.path.exists('../data/my_test1.csv'):
    df_test.to_csv('../data/my_test1.csv', index=False, mode='w', encoding='utf-8-sig')
else:
    df_test.to_csv('../data/my_test1.csv', index=False, mode='a', encoding='utf-8-sig', header=False)

# os.path.exists('../data/my_test1.csv')

In [26]:
my_encoding5 = find_encoding('../data/my_test1.csv')
df_my_test1 = pd.read_csv('../data/my_test1.csv', engine='python',encoding='UTF-8')
df_my_test1.head(10)

      상품명
콜라   2700
사이다  2000
콜라   2700
사이다  2000
콜라   2700
사이다  2000
콜라   2700
사이다  2000
콜라   2700
사이다  2000

In [27]:
my_encoding5    # File Encoding 방식이 UTF-8로 되어 있슴을 알 수가 있다.

'UTF-8-SIG'